/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Cannot Complete Action";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Try again later.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Cannot Record";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Cannot Record";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Stop any other actions using the %@ and try again."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Cannot Record";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "There is not enough available space to continue recording. Make room by deleting existing videos or photos.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "The maximum length for this recording has been reached."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "The maximum size for this recording has been reached."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Stop any other actions using the recording device and try again.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "The maximum length for this recording has been reached."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Cannot Record";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Cannot Use %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Stop any other actions using the %@ and try again."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Cannot Use %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Stop any other actions using the %@ and try again."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Stop any other actions using the recording device and try again.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Cannot Complete Action";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Try again later.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Cannot Complete Export";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Try exporting again.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "This media format is not supported.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "This media format is not supported.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Cannot Save";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Try saving again.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "This media cannot be used.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "This media cannot be used.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "This media cannot be used.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "This media cannot be used.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "This media format is not supported.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "This media may be damaged.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Cannot Take Photo";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Try taking a photo again.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "This app is not authorized to play this file."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "This media cannot be used.";
